Repository: capstanlqc/cli_automation
Catalog: conv_flash_xlsxs_to_tmxs/output/Eurobarometer_FLASH-002_mlt-MLT_MRT.tmx
Source language: en_us
Languages: mt_mt

source: Answer {ANSWER} is not numeric.
mt_mt: It-tweġiba {ANSWER} mhijiex numerika.

source: <b>Thank you for your participation. Please click next and then close the browser.</b>
mt_mt: <b>Nirringrazzjawk għall-parteċipazzjoni tiegħek. Jekk jogħġbok ikklikkja li jmiss u mbagħad agħlaq il-browser.</b>

source: The European General Data Protection Regulation (GDPR) requires us to first speak to a parent or legal guardian of a teenager. Can I speak to this teenager’s parent or legal guardian? (SINGLE ANSWER, DO NOT READ OUT)
mt_mt: Ir-Regolament Ġenerali Ewropew dwar il-Protezzjoni tad-Data (GDPR) jeħtieġ li l-ewwel inkellmu ġenitur jew il-gwardjan legali taż-żagħżugħ(a). Nista' nitkellem mal-ġenitur jew il-gwardjan legali taż-żagħżugħ(a)? (TWEĠIBA WAĦDA, TAQRAX)

source: French
mt_mt: Il-Franċiż

source: Hello, My name is …, from (NAME OF NATIONAL INSTITUTE), and I'm conducting an interview for Ipsos Public Affairs, on behalf of one of their clients. We are looking for people aged 16 or over who are willing to share their opinions about the issues of today’s society. We are conducting this survey across Europe. The survey is not part of any market research, we are interested in measuring public opinion. I would be grateful if you could spare {#minutes_ins} minutes to participate in this survey. Participation in the survey is voluntary and you can change your mind at any time. All of your answers will remain confidential and will be combined with all other participants’ answers. This means you will not be identifiable in any of the published results. {#CONSENT_ins} If you would like to read the Data Protection Notice, you can access it at {#intro_link}. This explains the purpose for processing your personal data as well as your data protection rights. For quality assurance, this phone call may be monitored and recorded. INTERVIEWER ADD IF ASKED: HOW DID YOU GET MY NUMBER: Your telephone number has been randomly generated by a computer, like all numbers we dial for this research. Our aim is to interview a representative sample of this country’s population. CLIENT? Ipsos is conducting this survey for the {#Client}. Flash Eurobarometer surveys have as purpose to monitor public opinion in the European Union on a broad range of thematic issues. WHAT PERSONAL DATA WILL BE COLLECTED: We use your phone number to invite you to take part in this interview and for quality control purposes only. Gender and age information will be collected, as well as personal data from the replies to the interview questions (such as marital status). All of the information you provide will remain confidential, your answers will be combined with all other participants’ answers, and no identifiable data will be shared with Ipsos’ client. Are you happy to proceed with the interview? {#Birthday_ins}
mt_mt: Hello, Jisimni..., minn (ISEM TAL-ISTITUT NAZZJONALI), u qed inwettaq intervista għal Ipsos Public Affairs, f'isem wieħed mill-klijenti tagħhom. Qegħdin infittxu persuni minn 16-il sena 'l fuq li jixtiequ jaqsmu l-opinjonijiet tagħhom dwar il-kwistjonijiet tas-soċjetà tal-lum. Qed inwettqu dan l-istħarriġ madwar l-Ewropa. L-istħarriġ mhuwiex parti minn kwalunkwe riċerka tas-suq, aħna interessati li nkejlu l-opinjoni pubblika. Napprezzaw jekk tikkonċedilna {#minutes_ins} ftit minuti biex tipparteċipa f'dan l-istħarriġ. Il-parteċipazzjoni f'dan l-istħarriġ hija volontarja, u inti tista' tibdel fehmtek fi kwalunkwe ħin. It-tweġibiet kollha tiegħek kollha se jibqgħu kunfidenzjali u se jiġu kombinati mat-tweġibiet tal-parteċipanti l-oħrajn kollha. Dan ifisser li inti mhux se tkun tista' tiġi identifikat(a) fi kwalunkwe mir-riżultati li jiġu ppubblikati. {#CONSENT_ins} Jekk tixtieq taqra l-Avviż dwar il-Protezzjoni tad-Data, tista’ taċċessah fuq {#intro_link}. Dan jispjega l-iskop għall-ipproċessar tad-data personali tiegħek kif ukoll id-drittijiet ta' protezzjoni tad-data tiegħek. Għal raġunijiet ta' kwalità, din it-telefonata tista' tiġi monitorjata u reġistrata. INTERVISTATUR ŻID JEKK TIĠI MITLUB: KIF SIBT IN-NUMRU TIEGĦI: In-numru tat-telefon tiegħek ġie ġġenerat b'mod każwali minn kompjuter, bħan-numri kollha li nċemplu għal din ir-riċerka. L-għan tagħna huwa li nintervistaw kampjun rappreżentattiv tal-popolazzjoni ta' dan il-pajjiż. IL-KLIJENT? Ipsos qed twettaq dan l-istħarriġ għal [{#Client}]. L-istħarriġiet tal-Flash Eurobarometer għandhom l-iskop li jimmonitorjaw l-opinjoni pubblika fl-Unjoni Ewropea dwar firxa wiesgħa ta' kwistjonijiet tematiċi. LIEMA DATA PERSONALI SE TINĠABAR: Aħna nużaw in-numru tat-telefon tiegħek biex nistednuk tieħu sehem f'din l-intervista u għal skopijiet ta' kontroll tal-kwalità biss. Se tinġabar informazzjoni dwar il-ġeneru u l-età, kif ukoll data personali mit-tweġibiet għall-mistoqsijiet tal-intervista (bħall-istat ċivili). L-informazzjoni kollha li tipprovdi se tibqa' kunfidenzjali, it-tweġibiet tiegħek se jiġu kombinati mat-tweġibiet tal-parteċipanti l-oħra kollha, u l-ebda data identifikabbli mhi se tiġi maqsuma mal-klijent ta' Ipsos. Tixtieq tkompli bl-intervista? {#Birthday_ins}

source: Never been in full-time education
mt_mt: Qatt ma kont fl-edukazzjoni full-time

source: Belgium
mt_mt: Il-Belġju

source: More than 10 years
mt_mt: Aktar minn 10 snin

source: Portuguese
mt_mt: Il-Portugiż

source: Refusal (SPONTANEOUS)
mt_mt: Rifjut (SPONTANJA)

source: <{#D1_age_ins} years
mt_mt: <{#D1_age_ins} snin

source: Other
mt_mt: Oħrajn

source: Approximately, what percentage of the value of your company's products and or services were sold to other EU Member States in {#CurrentYear_insert_1}? ADD, IF NEEDED: If you are not sure, please provide your best estimate. (READ OUT IF NECESSARY, ONE ANSWER ONLY)
mt_mt: Bejn wieħed u ieħor, x'perċentwal tal-valur tal-prodotti u/jew servizzi tal-kumpanija tiegħek inbiegħu lejn Stati Membri tal-UE oħrajn fl-{#CurrentYear_insert_1}? ŻID, JEKK MEĦTIEĠ: Jekk m'intix ċert(a), jekk jogħġbok agħti l-aħjar stima tiegħek. (AQRA JEKK MEĦTIEĠ, TWEĠIBA WAĦDA BISS)

source: Bulgaria
mt_mt: Il-Bulgarija

source: Over the last year, would you say that this image you have of the EU improved, got worse or stayed about the same? {#SD15_ins}
mt_mt: F'din l-aħħar sena, tgħid li din l-immaġni li għandek tal-UE tjiebet, saret agħar jew baqgħet qisu l-istess? {#SD15_ins}

source: Activities of households as employers; undifferentiate goods and services producing activities of households for own use
mt_mt: ATTIVITAJIET TA' PERSUNI TAD-DAR BĦALA PERSUNI LI JĦADDMU; ATTIVITAJIET TA' PRODUZZJONI TA' OĠĠETTI U SERVIZZI MHUX IDDIFFERENZJATI GĦALL-UŻU TA' L-INDIVIDWU STESS

source: Electricity, gas, steam and air conditioning supply
mt_mt: PROVVISTA TA' ELETTRIKU, GASS, FWAR U ARJA KKONDIZZJONATA

source: Please enter a value between 0 and 20.
mt_mt: Jekk jogħġbok daħħal valur bejn 0 u 20.

source: Do you know if, in {#CurrentYear_insert_1}, your company has: (READ OUT, ONE ANSWER PER LINE)
mt_mt: Taf jekk, fi {#CurrentYear_insert_1}, il-kumpanija tiegħek: (AQRA, TWEĠIBA WAĦDA GĦAL KULL LINJA)

source: Don't know/No Answer (DO NOT READ OUT)
mt_mt: Ma nafx/Bla risposta (TAQRAX)

source: Seeking a job
mt_mt: Qed tfittex xoghol

source: More than 50,000 to 100,000 euro
mt_mt: Aktar minn 50 000 sa 100 000 ewro

source: No, I am not the parent/legal guardian
mt_mt: Le, jien mhux il-ġenitur/gwardjan legali

source: Czechia
mt_mt: Iċ-Ċekja

source: Manager of a company
mt_mt: Maniġer ta' kumpanija

source: Do you also use one or more mobile phones? {#D2_ins}
mt_mt: Tuża wkoll mowbajl wieħed jew iktar? {#D2_ins}

source: Neutral
mt_mt: Newtrali

source: Ireland
mt_mt: L-Irlanda

source: What is your nationality or nationalities if you hold more than one? {#D3a_ins}
mt_mt: X'inhi n-nazzjonalità tiegħek jew nazzjonalitajiet jekk għandek iktar minn waħda? {#D3a_ins}

source: 250 to 499 employees
mt_mt: 250 sa 499 impjegat jew aktar

source: Fairly positive
mt_mt: Pjuttost pożittiva

source: Between 1 January {#CurrentYear_insert_6} and 1 January {#CurrentYear_insert_1}
mt_mt: Bejn l-1 ta' Jannar {#CurrentYear_insert_6} u l-1 ta' Jannar {#CurrentYear_insert_1}

source: Targeted respondent not available, call back later
mt_mt: Ir-rispondent fil-mira mhux disponibbli, ċempel aktar tard

source: I’m opposed to the idea of the European Union in general
mt_mt: Jien kontra l-idea tal-Unjoni Ewropea b'mod ġenerali

source: Austria
mt_mt: L-Awstrija

source: Less than 1 year
mt_mt: Anqas minn sena

source: More than 250,000 to 500,000 euro
mt_mt: Aktar minn 250,000 ewro sa 500,000 ewro

source: Improved
mt_mt: Tjiebet

source: Do you also have a landline telephone at home? Do not include telephones only used for business purposes or for connecting to the Internet or to a fax machine. {#D2_ins}
mt_mt: Għandek ukoll telefon bil-linja fissa fid-dar tiegħek? Tinkludix telefons użati biss għal skopijiet tan-negozju jew għall-konnessjoni mal-Internet jew ma' magna tal-faks. {#D2_ins}

source: Not applicable (DO NOT READ OUT)
mt_mt: Mhux applikabbli (TAQRAX)

source: Which of the following statements regarding the European Union is closest to your opinion? {#D2_ins}
mt_mt: Liema mid-dikjarazzjonijiet li ġejjin dwar l-Unjoni Ewropea hija l-aktar qrib tal-opinjoni tiegħek? {#D2_ins}

source: Decreased
mt_mt: Naqas

source: Retired
mt_mt: Irtirat/a

source: Slovenia
mt_mt: Is-Slovenja

source: None, sole trader (DO NOT READ OUT)
mt_mt: L-ebda, kummerċjant waħdieni (TAQRAX)

source: Office clerk
mt_mt: Skrivan (office clerk)

source: Irish
mt_mt: L-Irlandiż

source: Remained about the same
mt_mt: Baqa' qisu l-istess

source: Please enter a value between {#D1_age_ins} and 105. If the respondent is less than {#D1_age_ins} years, select response “<{#D1_age_ins} years”.
mt_mt: Jekk jogħġbok daħħal valur bejn {#D1_age_ins} u 105. Jekk ir-rispondent għandu inqas minn {#D1_age_ins} snin, agħżel it-tweġiba “<{#D1_age_ins} snin”.

source: Do we have your permission to conduct this interview with your child?
mt_mt: Tagħtina l-permess tiegħek biex nagħmlu din l-intervista lil ibnek/bintek?

source: European political matters
mt_mt: Kwistjonijiet dwar il-politika Ewropea

source: Owned or controlled entirely by persons from (THIS COUNTRY)
mt_mt: Proprjetà ta' jew ikkontrollata kompletament minn persuni minn Malta

source: Small or medium-sized town
mt_mt: Belt ta' daqs żgħir jew medju

source: Would you say you are…? {#D2_ins}
mt_mt: Tgħid li inti ...? {#D2_ins}

source: Luxembourg
mt_mt: Il-Lussemburgu

source: Don't know (DO NOT READ OUT)
mt_mt: Ma nafx (TAQRAX)

source: I’m in favour of the European Union as it has been realised so far
mt_mt: Jien favur l-Unjoni Ewropea kif ġiet realizzata sa issa

source: Professional, scientific and technical activities
mt_mt: ATTIVITAJIET PROFESSJONALI, XJENTIFIĊI U TEKNIĊI

source: European Central Bank
mt_mt: Bank Ċentrali Ewropew

source: 15 years old, but not available/not at home
mt_mt: 15-il sena, iżda mhux disponibbli/ ma jinsabx/tinsabx fid-dar

source: Below 10% owned by persons from other countries outside (THIS COUNTRY)
mt_mt: Inqas minn 10% proprjetà ta' persuni minn pajjiżi oħra barra minn Malta

source: (DO NOT READ OUT)
mt_mt: (TAQRAX)

source: Professional (employed doctor, lawyer, accountant, architect, …)
mt_mt: Professjonist (impjegat bħala avukat, tabib, accountant, perit, ...)

source: Services directly to consumers
mt_mt: servizzi direttament lill-konsumaturi

source: Poland
mt_mt: Il-Polonja

source: Executive Agency for Small and Medium-sized Enterprises
mt_mt: Aġenzija Eżekuttiva għall-Intrapriżi Żgħar u Medji

source: When you get together with friends or relatives, would you say you discuss frequently, occasionally or never about...? {#SD14a_ins}
mt_mt: Meta tiltaqa' ma' ħbieb jew ma' qraba tista' tgħid li tiddiskutu spiss, kultant jew qatt dwar…? {#SD14a_ins}

source: Occasionally
mt_mt: Kultant

source: Products to companies or other organisations
mt_mt: prodotti lil kumpaniji jew organizzazzjonijiet oħrajn

source: Italian
mt_mt: It-Taljan

source: Other employee (salesman, nurse, …)
mt_mt: Impjegat ieħor (bejjiegħ, ners, ...)

source: Local political matters
mt_mt: Kwistjonijiet politiċi lokali

source: Agriculture, Forestry and Fishing
mt_mt: AGRIKOLTURA, FORESTRIJA U SAJD

source: Manufacturing
mt_mt: MANIFATTURA

source: When was your company established? (READ OUT, ONE ANSWER ONLY)
mt_mt: Meta ġiet stabbilita l-kumpanija tiegħek?

source: The survey includes some questions that could be considered sensitive as they relate to political opinions. Your child may refuse to answer these questions at any time, and you can withdraw your consent for your child’s participation at any time.
mt_mt: L-istħarriġ jinkludi xi mistoqsijiet li jistgħu jitqiesu ta' natura sensittiva għaliex huma relatati ma' opinjonijiet politiċi. Ibnek jista' jirrifjuta li jwieġeb/Bintek tista' tirrifjuta li twieġeb għal dawn il-mistoqsijiet fi kwalunkwe ħin, u inti tista' tirtira l-kunsens tiegħek għall-parteċipazzjoni ta' ibnek/bintek fi kwalunkwe ħin.

source: Sweden
mt_mt: L-Iżvezja

source: Very positive
mt_mt: Pożittiva ħafna

source: European Economic and Social Committee
mt_mt: Kumitat Ekonomiku u Soċjali Ewropew

source: Civil servant
mt_mt: Impjegat mal-gvern

source: Dutch
mt_mt: In-Netherlandiż

source: The answer does not have enough text, current length is {LENGTH}, minimum is {MINLENGTH}.
mt_mt: It-tweġiba m’għandhiex biżżejjed test, it-tul attwali huwa {LENGTH}, il-minimu huwa {MINLENGTH}.

source: <p>Those are all the questions we have for you today. Thank you for your time.</p><p>All information you provide is kept strictly confidential and is used for research purposes only.</p>
mt_mt: <p>Dawk huma l-mistoqsijiet kollha li għandna għalik illum. Grazzi tal-ħin tiegħek.</p><p>Kull informazzjoni li tipprovdi ser tibqa' strettament kunfidenzjali, u ser tiġi użata għall-għanijiet tar-riċerka biss.</p>

source: years
mt_mt: snin

source: European External Action Service
mt_mt: Servizz Ewropew għall-Azzjoni Esterna

source: Increased
mt_mt: Żdied

source: More than 10 to 50 million euro
mt_mt: Aktar minn 10 miljun ewro sa 50 miljun ewro

source: The survey includes some questions that could be considered sensitive as they relate to political opinions. You may refuse to answer these questions at any time, and you can withdraw your consent for participation at any time.
mt_mt: L-istħarriġ jinkludi xi mistoqsijiet li jistgħu jitqiesu ta' natura sensittiva għaliex huma relatati ma' opinjonijiet politiċi. Inti tista' tirrifjuta li twieġeb għal dawn il-mistoqsijiet fi kwalunkwe ħin, u tista' tirtira l-kunsens tiegħek għall-parteċipazzjoni fi kwalunkwe ħin.

source: Put through to the targeted respondent
mt_mt: Għaddewk mar-rispondent fil-mira

source: British
mt_mt: L-Ingliż

source: Please enter a value between 15 and 105. If you are less than 15 years old, you are not eligible to participate in this study.
mt_mt: Jekk jogħġbok daħħal valur bejn 15 u 105. Jekk għandek inqas minn 15-il sena, m'intix eliġibbli biex tipparteċipa f'dan l-istudju.

source: <b>Public services</b>
mt_mt: <b>Servizzi pubbliċi</b>

source: More than 2 to 10 million euro
mt_mt: Aktar minn 2 miljun ewro sa 10 miljun ewro

source: I would like to reassure you that your child's cooperation is completely voluntary. All answers are confidential and combined with other participants’ answers. This means your child will not be identifiable in any of the published results. {#PARENT3_ins} If you would like to read the Data Protection Notice, you can access it at {#intro_link}. This explains the purpose for processing your personal data as well as your data protection rights. INTERVIEWER ADD IF ASKED: HOW DID YOU GET MY NUMBER: Your telephone number has been randomly generated by a computer, like all numbers we dial for this research. Our aim is to interview a representative sample of this country’s population. CLIENT? Ipsos is conducting this survey for the {#Client}. Flash Eurobarometer surveys have as purpose to monitor public opinion in the European Union on a broad range of thematic issues. WHAT PERSONAL DATA WILL BE COLLECTED: We use your phone number to invite you to take part in this interview and for quality control purposes only. Gender and age information will be collected, as well as personal data from the replies to the interview questions (such as marital status). All of the information you provide will remain confidential, your answers will be combined with all other participants’ answers, and no identifiable data will be shared with Ipsos’ client. Do we have your permission to conduct this interview with your child? {#Birthday_ins}
mt_mt: Nixtieq nassigurak li l-kooperazzjoni ta' ibnek/bintek hija totalment volontarja. It-tweġibiet kollha huma kunfidenzjali u jiġu kombinati mat-tweġibiet ta' parteċipanti oħrajn. Dan ifisser li ibnek/bintek mhux se jkunu jistgħu jiġu identifikati fi kwalunkwe mir-riżultati li jiġu ppubblikati. {#PARENT3_ins} Jekk tixtieq taqra l-Avviż dwar il-Protezzjoni tad-Data, tista’ taċċessah fuq {#intro_link}. Dan jispjega l-iskop għall-ipproċessar tad-data personali tiegħek kif ukoll id-drittijiet ta' protezzjoni tad-data tiegħek. INTERVISTATUR ŻID JEKK TIĠI MITLUB: KIF SIBT IN-NUMRU TIEGĦI: In-numru tat-telefon tiegħek ġie ġġenerat b'mod każwali minn kompjuter, bħan-numri kollha li nċemplu għal din ir-riċerka. L-għan tagħna huwa li nintervistaw kampjun rappreżentattiv tal-popolazzjoni ta' dan il-pajjiż. IL-KLIJENT? Ipsos qed twettaq dan l-istħarriġ għal [{#Client}]. L-istħarriġiet tal-Flash Eurobarometer għandhom l-iskop li jimmonitorjaw l-opinjoni pubblika fl-Unjoni Ewropea dwar firxa wiesgħa ta' kwistjonijiet tematiċi. LIEMA DATA PERSONALI SE TINĠABAR: Aħna nużaw in-numru tat-telefon tiegħek biex nistednuk tieħu sehem f'din l-intervista u għal skopijiet ta' kontroll tal-kwalità biss. Se tinġabar informazzjoni dwar il-ġeneru u l-età, kif ukoll data personali mit-tweġibiet għall-mistoqsijiet tal-intervista (bħall-istat ċivili). L-informazzjoni kollha li tipprovdi se tibqa' kunfidenzjali, it-tweġibiet tiegħek se jiġu kombinati mat-tweġibiet tal-parteċipanti l-oħra kollha, u l-ebda data identifikabbli mhi se tiġi maqsuma mal-klijent ta' Ipsos. Tagħtina l-permess tiegħek biex nagħmlu din l-intervista lil ibnek/bintek? {#Birthday_ins}

source: Water Supply; sewerage, waste management and remediation activities
mt_mt: PROVVISTA TA' L-ILMA; SISTEMA TA' DRENAĠĠI, IMMANIĠĠAR TA' L-ISKART U ATTIVITAJIET TA' RIMEDJAZZJONI

source: How old were you when you stopped full-time education? {#D4_ins}
mt_mt: Kemm kellek żmien meta waqaft l-edukazzjoni full-time tiegħek?

source: European Insurance and Occupational Pensions Agency
mt_mt: Aġenzija Ewropea tal-Assigurazzjoni u l-Pensjonijiet tax-Xogħol

source: 16 years or older (will pass phone to start the interview)
mt_mt: 16-il sena jew ikbar (se jgħaddi t-telefon biex tibda l-intervista)

source: Unskilled manual worker
mt_mt: Ħaddiem tal-id mingħajr sengħa (Unskilled manual worker)

source: Employee
mt_mt: Impjegat

source: Less than 25,000 euro
mt_mt: Inqas minn 25 000 ewro

source: Refusal {#D5a_ins}
mt_mt: Rifjut {#D5a_ins}

source: Austrian
mt_mt: L-Awstrijak

source: Hungarian
mt_mt: L-Ungeriż

source: 1 to 9 employees
mt_mt: 1 sa 9 impjegati

source: Thank you for your time. We remind you that if you would like to read the Data Protection Notice, you can access it at {#intro_link}. This explains the purposes for processing your personal data as well as your rights under applicable data protection law.
mt_mt: Grazzi tal-ħin tiegħek. Nixtiequ nfakkruk li jekk tixtieq taqra l-Avviż dwar il-Protezzjoni tad-Data, inti tista' taċċessah fuq {#intro_link}. Dan jispjega l-iskop għall-ipproċessar tad-data personali tiegħek kif ukoll id-drittijiet tiegħek li japplikaw taħt il-liġi dwar il-protezzjoni tad-data applikabbli.

source: Consumers, Health, Agriculture and Food Executive Agency
mt_mt: Aġenzija Eżekuttiva għall-Konsumatur, is-Saħħa, l-Agrikoltura u l-Ikel

source: (SINGLE ANSWER, DO NOT READ OUT)
mt_mt: (TWEĠIBA WAĦDA, TAQRAX)

source: Refusal
mt_mt: Rifjut

source: <b>Trade, accommodation and food services</b>
mt_mt: <b>Servizzi ta' kummerċ, ta' akkomodazzjoni u tal-ikel</b>

source: Construction
mt_mt: KOSTRUZZJONI

source: Maltese
mt_mt: Il-Malti

source: Do you use more than one mobile phone? {#D2_ins}
mt_mt: Tuża aktar minn mowbajl wieħed? {#D2_ins}

source: Portugal
mt_mt: Il-Portugall

source: In which (region) is your company headquarers located?
mt_mt: F'liema (distrett) jinsabu l-uffiċċji prinċipali tal-kumpanija tiegħek?

source: The answer has too much text, current length is {LENGTH}, maximum is {MAXLENGTH}.
mt_mt: It-tweġiba fiha wisq test, it-tul attwali huwa {LENGTH}, il-massimu huwa {MAXLENGTH}.

source: European Commission
mt_mt: Kummissjoni Ewropea

source: 10 to 49 employees
mt_mt: 10 sa 49 impjegat

source: Yes (will pass phone to start the interview)
mt_mt: Iva (se jgħaddi t-telefon biex tibda l-intervista)
